MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC010/mcu.h
extern volatile U1EP11BITS U1EP11bits __attribute__((__sfr__));

#define U1EP12 U1EP12
extern volatile uint16_t U1EP12 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP12BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP12BITS;
extern volatile U1EP12BITS U1EP12bits __attribute__((__sfr__));

#define U1EP13 U1EP13
extern volatile uint16_t U1EP13 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP13BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP13BITS;
extern volatile U1EP13BITS U1EP13bits __attribute__((__sfr__));

#define U1EP14 U1EP14
extern volatile uint16_t U1EP14 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP14BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP14BITS;
extern volatile U1EP14BITS U1EP14bits __attribute__((__sfr__));

#define U1EP15 U1EP15
extern volatile uint16_t U1EP15 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP15BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP15BITS;
extern volatile U1EP15BITS U1EP15bits __attribute__((__sfr__));

#define SD1CON1 SD1CON1
extern volatile uint16_t SD1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSD1CON1BITS {
  union {
    struct {
      uint16_t PWRLVL:1;
      uint16_t SDREFP:1;
      uint16_t SDREFN:1;
      uint16_t :1;
      uint16_t VOSCAL:1;
      uint16_t :1;
      uint16_t DITHER:2;
      uint16_t SDGAIN:3;
      uint16_t FILTDIS:1;
      uint16_t SDRST:1;
      uint16_t SDSIDL:1;
      uint16_t :1;
      uint16_t SDON:1;
    };
    struct {
      uint16_t :6;
      uint16_t DITHER0:1;
      uint16_t DITHER1:1;
      uint16_t SDGAIN0:1;
      uint16_t SDGAIN1:1;
      uint16_t SDGAIN2:1;
    };
  };
} SD1CON1BITS;
extern volatile SD1CON1BITS SD1CON1bits __attribute__((__sfr__));

#define SD1CON2 SD1CON2
extern volatile uint16_t SD1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSD1CON2BITS {
  union {
    struct {
      uint16_t SDRDY:1;
      uint16_t :2;
      uint16_t RNDRES:2;
      uint16_t :3;
      uint16_t SDWM:2;
      uint16_t :2;
      uint16_t SDINT:2;
      uint16_t CHOP:2;
    };
    struct {
      uint16_t :3;
      uint16_t RNDRES0:1;
      uint16_t RNDRES1:1;
      uint16_t :3;
      uint16_t SDWM0:1;
      uint16_t SDWM1:1;
      uint16_t :2;
      uint16_t SDINT0:1;
      uint16_t SDINT1:1;
      uint16_t CHOP0:1;
      uint16_t CHOP1:1;
    };
  };
} SD1CON2BITS;
extern volatile SD1CON2BITS SD1CON2bits __attribute__((__sfr__));

#define SD1CON3 SD1CON3
extern volatile uint16_t SD1CON3 __attribute__((__sfr__));
__extension__ typedef struct tagSD1CON3BITS {
  union {
    struct {
      uint16_t SDCH:3;
      uint16_t :5;
      uint16_t SDCS:2;
      uint16_t SDOSR:3;
      uint16_t SDDIV:3;
    };
    struct {
      uint16_t SDCH0:1;
      uint16_t SDCH1:1;
      uint16_t SDCH2:1;
      uint16_t :5;
      uint16_t SDCS0:1;
      uint16_t SDCS1:1;
      uint16_t SDOSR0:1;
      uint16_t SDOSR1:1;
      uint16_t SDOSR2:1;
      uint16_t SDDIV0:1;
      uint16_t SDDIV1:1;
      uint16_t SDDIV2:1;
    };
  };
} SD1CON3BITS;
extern volatile SD1CON3BITS SD1CON3bits __attribute__((__sfr__));

#define SD1RESH SD1RESH
extern volatile uint16_t SD1RESH __attribute__((__sfr__));
#define SD1RESL SD1RESL
extern volatile uint16_t SD1RESL __attribute__((__sfr__));
#define ANCFG ANCFG
extern volatile uint16_t ANCFG __attribute__((__sfr__));
typedef struct tagANCFGBITS {
  uint16_t :2;
  uint16_t VBG2EN:1;
} ANCFGBITS;
extern volatile ANCFGBITS ANCFGbits __attribute__((__sfr__));

#define ANSA ANSA
extern volatile uint16_t ANSA __attribute__((__sfr__));
__extension__ typedef struct tagANSABITS {
  union {
    struct {
      uint16_t :1;
      uint16_t ANSA1:1;
      uint16_t ANSA2:1;
      uint16_t :1;
      uint16_t ANSA4:1;
      uint16_t ANSA5:1;
      uint16_t ANSA6:1;
      uint16_t ANSA7:1;
      uint16_t :1;
      uint16_t ANSA9:1;
      uint16_t ANSA10:1;
      uint16_t :3;
      uint16_t ANSA14:1;
      uint16_t ANSA15:1;
    };
    struct {
      uint16_t :1;
      uint16_t ANSELA1:1;
      uint16_t ANSELA2:1;
      uint16_t :1;
      uint16_t ANSELA4:1;
      uint16_t ANSELA5:1;
      uint16_t ANSELA6:1;
      uint16_t ANSELA7:1;
      uint16_t :1;
      uint16_t ANSELA9:1;
      uint16_t ANSELA10:1;
      uint16_t :3;
      uint16_t ANSELA14:1;
      uint16_t ANSELA15:1;
    };
  };
} ANSABITS;
extern volatile ANSABITS ANSAbits __attribute__((__sfr__));

#define ANSELA ANSELA
extern volatile uint16_t ANSELA __attribute__((__sfr__));
__extension__ typedef struct tagANSELABITS {
  union {
    struct {
      uint16_t :1;
      uint16_t ANSA1:1;
      uint16_t ANSA2:1;
      uint16_t :1;
      uint16_t ANSA4:1;
      uint16_t ANSA5:1;
      uint16_t ANSA6:1;
      uint16_t ANSA7:1;
      uint16_t :1;
      uint16_t ANSA9:1;
      uint16_t ANSA10:1;
      uint16_t :3;
      uint16_t ANSA14:1;
      uint16_t ANSA15:1;
    };
    struct {
      uint16_t :1;
      uint16_t ANSELA1:1;
      uint16_t ANSELA2:1;
      uint16_t :1;
      uint16_t ANSELA4:1;
      uint16_t ANSELA5:1;
      uint16_t ANSELA6:1;
      uint16_t ANSELA7:1;
      uint16_t :1;
      uint16_t ANSELA9:1;
      uint16_t ANSELA10:1;
      uint16_t :3;
      uint16_t ANSELA14:1;
      uint16_t ANSELA15:1;
    };
  };
} ANSELABITS;
extern volatile ANSELABITS ANSELAbits __attribute__((__sfr__));

#define ANSB ANSB
extern volatile uint16_t ANSB __attribute__((__sfr__));
__extension__ typedef struct tagANSBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t :4;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t :4;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSBBITS;
extern volatile ANSBBITS ANSBbits __attribute__((__sfr__));

#define ANSELB ANSELB
extern volatile uint16_t ANSELB __attribute__((__sfr__));
__extension__ typedef struct tagANSELBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t :4;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t :4;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSELBBITS;
extern volatile ANSELBBITS ANSELBbits __attribute__((__sfr__));

#define ANSC ANSC
extern volatile uint16_t ANSC __attribute__((__sfr__));
__extension__ typedef struct tagANSCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t ANSC1:1;
      uint16_t :1;
      uint16_t ANSC3:1;
      uint16_t ANSC4:1;
    };
    struct {
      uint16_t :1;
      uint16_t ANSELC1:1;
      uint16_t :1;
      uint16_t ANSELC3:1;
      uint16_t ANSELC4:1;
    };
  };
} ANSCBITS;
extern volatile ANSCBITS ANSCbits __attribute__((__sfr__));

#define ANSELC ANSELC
extern volatile uint16_t ANSELC __attribute__((__sfr__));
__extension__ typedef struct tagANSELCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t ANSC1:1;
      uint16_t :1;
      uint16_t ANSC3:1;
      uint16_t ANSC4:1;
    };
    struct {
      uint16_t :1;
      uint16_t ANSELC1:1;
      uint16_t :1;
      uint16_t ANSELC3:1;
      uint16_t ANSELC4:1;
    };
  };
} ANSELCBITS;
extern volatile ANSELCBITS ANSELCbits __attribute__((__sfr__));

#define ANSD ANSD
extern volatile uint16_t ANSD __attribute__((__sfr__));
__extension__ typedef struct tagANSDBITS {
  union {
    struct {
      uint16_t ANSD0:1;
      uint16_t ANSD1:1;
      uint16_t ANSD2:1;
      uint16_t ANSD3:1;
      uint16_t ANSD4:1;
      uint16_t ANSD5:1;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t ANSD8:1;
      uint16_t ANSD9:1;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
      uint16_t ANSD12:1;
      uint16_t ANSD13:1;
      uint16_t ANSD14:1;
      uint16_t ANSD15:1;
    };
    struct {
      uint16_t ANSELD0:1;
      uint16_t ANSELD1:1;
      uint16_t ANSELD2:1;
      uint16_t ANSELD3:1;
      uint16_t ANSELD4:1;
      uint16_t ANSELD5:1;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t ANSELD8:1;
      uint16_t ANSELD9:1;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
      uint16_t ANSELD12:1;
      uint16_t ANSELD13:1;
      uint16_t ANSELD14:1;
      uint16_t ANSELD15:1;
    };
  };
} ANSDBITS;
extern volatile ANSDBITS ANSDbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t ANSELD __attribute__((__sfr__));
__extension__ typedef struct tagANSELDBITS {
  union {
    struct {
      uint16_t ANSD0:1;
      uint16_t ANSD1:1;
      uint16_t ANSD2:1;
      uint16_t ANSD3:1;
      uint16_t ANSD4:1;
      uint16_t ANSD5:1;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t ANSD8:1;
      uint16_t ANSD9:1;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
      uint16_t ANSD12:1;
      uint16_t ANSD13:1;
      uint16_t ANSD14:1;
      uint16_t ANSD15:1;
    };
    struct {
      uint16_t ANSELD0:1;
      uint16_t ANSELD1:1;
      uint16_t ANSELD2:1;
      uint16_t ANSELD3:1;
      uint16_t ANSELD4:1;
      uint16_t ANSELD5:1;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t ANSELD8:1;
      uint16_t ANSELD9:1;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
      uint16_t ANSELD12:1;
      uint16_t ANSELD13:1;
      uint16_t ANSELD14:1;
      uint16_t ANSELD15:1;
    };
  };
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define ANSE ANSE
extern volatile uint16_t ANSE __attribute__((__sfr__));
__extension__ typedef struct tagANSEBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSE4:1;
      uint16_t ANSE5:1;
      uint16_t ANSE6:1;
      uint16_t ANSE7:1;
      uint16_t :1;
      uint16_t ANSE9:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELE4:1;
      uint16_t ANSELE5:1;
      uint16_t ANSELE6:1;
      uint16_t ANSELE7:1;
      uint16_t :1;
      uint16_t ANSELE9:1;
    };
  };
} ANSEBITS;
extern volatile ANSEBITS ANSEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile uint16_t ANSELE __attribute__((__sfr__));
__extension__ typedef struct tagANSELEBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSE4:1;
      uint16_t ANSE5:1;
      uint16_t ANSE6:1;
      uint16_t ANSE7:1;
      uint16_t :1;
      uint16_t ANSE9:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELE4:1;
      uint16_t ANSELE5:1;
      uint16_t ANSELE6:1;
      uint16_t ANSELE7:1;
      uint16_t :1;
      uint16_t ANSELE9:1;
    };
  };
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define ANSELF ANSELF
extern volatile uint16_t ANSELF __attribute__((__sfr__));
__extension__ typedef struct tagANSELFBITS {
  union {
    struct {
      uint16_t ANSF0:1;
      uint16_t :1;
      uint16_t ANSF2:1;
      uint16_t ANSF3:1;
      uint16_t ANSF4:1;
      uint16_t ANSF5:1;
      uint16_t :1;
      uint16_t ANSF7:1;
      uint16_t ANSF8:1;
      uint16_t :4;
      uint16_t ANSF13:1;
    };
    struct {
      uint16_t ANSELF0:1;
      uint16_t :1;
      uint16_t ANSELF2:1;
      uint16_t ANSELF3:1;
      uint16_t ANSELF4:1;
      uint16_t ANSELF5:1;
      uint16_t :1;
      uint16_t ANSELF7:1;
      uint16_t ANSELF8:1;
      uint16_t :4;
      uint16_t ANSELF13:1;
    };
  };
} ANSELFBITS;
extern volatile ANSELFBITS ANSELFbits __attribute__((__sfr__));

#define ANSF ANSF
extern volatile uint16_t ANSF __attribute__((__sfr__));
__extension__ typedef struct tagANSFBITS {
  union {
    struct {
      uint16_t ANSF0:1;
      uint16_t :1;
      uint16_t ANSF2:1;
      uint16_t ANSF3:1;
      uint16_t ANSF4:1;
      uint16_t ANSF5:1;
      uint16_t :1;
      uint16_t ANSF7:1;
      uint16_t ANSF8:1;
      uint16_t :4;
      uint16_t ANSF13:1;
    };
    struct {
      uint16_t ANSELF0:1;
      uint16_t :1;
      uint16_t ANSELF2:1;
      uint16_t ANSELF3:1;
      uint16_t ANSELF4:1;
      uint16_t ANSELF5:1;
      uint16_t :1;
      uint16_t ANSELF7:1;
      uint16_t ANSELF8:1;
      uint16_t :4;
      uint16_t ANSELF13:1;
    };
  };
} ANSFBITS;
