MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC010/mcu.h
/* ADTBL16 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL17 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL18 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL19 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL20 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL21 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL22 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL23 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL24 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL25 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

