MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC010/mcu.h
#define _U1EP10_EPOUTEN_POSITION                 0x00000003
#define _U1EP10_EPOUTEN_MASK                     0x00000008
#define _U1EP10_EPOUTEN_LENGTH                   0x00000001

#define _U1EP11_EPHSHK_POSITION                  0x00000000
#define _U1EP11_EPHSHK_MASK                      0x00000001
#define _U1EP11_EPHSHK_LENGTH                    0x00000001

#define _U1EP11_EPSTALL_POSITION                 0x00000001
#define _U1EP11_EPSTALL_MASK                     0x00000002
#define _U1EP11_EPSTALL_LENGTH                   0x00000001

#define _U1EP11_EPTXEN_POSITION                  0x00000002
#define _U1EP11_EPTXEN_MASK                      0x00000004
#define _U1EP11_EPTXEN_LENGTH                    0x00000001

#define _U1EP11_EPRXEN_POSITION                  0x00000003
#define _U1EP11_EPRXEN_MASK                      0x00000008
#define _U1EP11_EPRXEN_LENGTH                    0x00000001

#define _U1EP11_EPCONDIS_POSITION                0x00000004
#define _U1EP11_EPCONDIS_MASK                    0x00000010
#define _U1EP11_EPCONDIS_LENGTH                  0x00000001

#define _U1EP11_EPINEN_POSITION                  0x00000002
#define _U1EP11_EPINEN_MASK                      0x00000004
#define _U1EP11_EPINEN_LENGTH                    0x00000001

#define _U1EP11_EPOUTEN_POSITION                 0x00000003
#define _U1EP11_EPOUTEN_MASK                     0x00000008
#define _U1EP11_EPOUTEN_LENGTH                   0x00000001

#define _U1EP12_EPHSHK_POSITION                  0x00000000
#define _U1EP12_EPHSHK_MASK                      0x00000001
#define _U1EP12_EPHSHK_LENGTH                    0x00000001

#define _U1EP12_EPSTALL_POSITION                 0x00000001
#define _U1EP12_EPSTALL_MASK                     0x00000002
#define _U1EP12_EPSTALL_LENGTH                   0x00000001

#define _U1EP12_EPTXEN_POSITION                  0x00000002
#define _U1EP12_EPTXEN_MASK                      0x00000004
#define _U1EP12_EPTXEN_LENGTH                    0x00000001

#define _U1EP12_EPRXEN_POSITION                  0x00000003
#define _U1EP12_EPRXEN_MASK                      0x00000008
#define _U1EP12_EPRXEN_LENGTH                    0x00000001

#define _U1EP12_EPCONDIS_POSITION                0x00000004
#define _U1EP12_EPCONDIS_MASK                    0x00000010
#define _U1EP12_EPCONDIS_LENGTH                  0x00000001

#define _U1EP12_EPINEN_POSITION                  0x00000002
#define _U1EP12_EPINEN_MASK                      0x00000004
#define _U1EP12_EPINEN_LENGTH                    0x00000001

#define _U1EP12_EPOUTEN_POSITION                 0x00000003
#define _U1EP12_EPOUTEN_MASK                     0x00000008
#define _U1EP12_EPOUTEN_LENGTH                   0x00000001

#define _U1EP13_EPHSHK_POSITION                  0x00000000
#define _U1EP13_EPHSHK_MASK                      0x00000001
#define _U1EP13_EPHSHK_LENGTH                    0x00000001

#define _U1EP13_EPSTALL_POSITION                 0x00000001
#define _U1EP13_EPSTALL_MASK                     0x00000002
#define _U1EP13_EPSTALL_LENGTH                   0x00000001

#define _U1EP13_EPTXEN_POSITION                  0x00000002
#define _U1EP13_EPTXEN_MASK                      0x00000004
#define _U1EP13_EPTXEN_LENGTH                    0x00000001

#define _U1EP13_EPRXEN_POSITION                  0x00000003
#define _U1EP13_EPRXEN_MASK                      0x00000008
#define _U1EP13_EPRXEN_LENGTH                    0x00000001

#define _U1EP13_EPCONDIS_POSITION                0x00000004
#define _U1EP13_EPCONDIS_MASK                    0x00000010
#define _U1EP13_EPCONDIS_LENGTH                  0x00000001

#define _U1EP13_EPINEN_POSITION                  0x00000002
#define _U1EP13_EPINEN_MASK                      0x00000004
#define _U1EP13_EPINEN_LENGTH                    0x00000001

#define _U1EP13_EPOUTEN_POSITION                 0x00000003
#define _U1EP13_EPOUTEN_MASK                     0x00000008
#define _U1EP13_EPOUTEN_LENGTH                   0x00000001

#define _U1EP14_EPHSHK_POSITION                  0x00000000
#define _U1EP14_EPHSHK_MASK                      0x00000001
#define _U1EP14_EPHSHK_LENGTH                    0x00000001

#define _U1EP14_EPSTALL_POSITION                 0x00000001
#define _U1EP14_EPSTALL_MASK                     0x00000002
#define _U1EP14_EPSTALL_LENGTH                   0x00000001

#define _U1EP14_EPTXEN_POSITION                  0x00000002
#define _U1EP14_EPTXEN_MASK                      0x00000004
#define _U1EP14_EPTXEN_LENGTH                    0x00000001

#define _U1EP14_EPRXEN_POSITION                  0x00000003
#define _U1EP14_EPRXEN_MASK                      0x00000008
#define _U1EP14_EPRXEN_LENGTH                    0x00000001

#define _U1EP14_EPCONDIS_POSITION                0x00000004
#define _U1EP14_EPCONDIS_MASK                    0x00000010
#define _U1EP14_EPCONDIS_LENGTH                  0x00000001

#define _U1EP14_EPINEN_POSITION                  0x00000002
#define _U1EP14_EPINEN_MASK                      0x00000004
#define _U1EP14_EPINEN_LENGTH                    0x00000001

#define _U1EP14_EPOUTEN_POSITION                 0x00000003
#define _U1EP14_EPOUTEN_MASK                     0x00000008
#define _U1EP14_EPOUTEN_LENGTH                   0x00000001

#define _U1EP15_EPHSHK_POSITION                  0x00000000
#define _U1EP15_EPHSHK_MASK                      0x00000001
#define _U1EP15_EPHSHK_LENGTH                    0x00000001

#define _U1EP15_EPSTALL_POSITION                 0x00000001
#define _U1EP15_EPSTALL_MASK                     0x00000002
#define _U1EP15_EPSTALL_LENGTH                   0x00000001

#define _U1EP15_EPTXEN_POSITION                  0x00000002
#define _U1EP15_EPTXEN_MASK                      0x00000004
#define _U1EP15_EPTXEN_LENGTH                    0x00000001

#define _U1EP15_EPRXEN_POSITION                  0x00000003
#define _U1EP15_EPRXEN_MASK                      0x00000008
#define _U1EP15_EPRXEN_LENGTH                    0x00000001

#define _U1EP15_EPCONDIS_POSITION                0x00000004
#define _U1EP15_EPCONDIS_MASK                    0x00000010
#define _U1EP15_EPCONDIS_LENGTH                  0x00000001

#define _U1EP15_EPINEN_POSITION                  0x00000002
#define _U1EP15_EPINEN_MASK                      0x00000004
#define _U1EP15_EPINEN_LENGTH                    0x00000001

#define _U1EP15_EPOUTEN_POSITION                 0x00000003
#define _U1EP15_EPOUTEN_MASK                     0x00000008
#define _U1EP15_EPOUTEN_LENGTH                   0x00000001

#define _SD1CON1_PWRLVL_POSITION                 0x00000000
#define _SD1CON1_PWRLVL_MASK                     0x00000001
#define _SD1CON1_PWRLVL_LENGTH                   0x00000001

#define _SD1CON1_SDREFP_POSITION                 0x00000001
#define _SD1CON1_SDREFP_MASK                     0x00000002
#define _SD1CON1_SDREFP_LENGTH                   0x00000001

#define _SD1CON1_SDREFN_POSITION                 0x00000002
#define _SD1CON1_SDREFN_MASK                     0x00000004
#define _SD1CON1_SDREFN_LENGTH                   0x00000001

#define _SD1CON1_VOSCAL_POSITION                 0x00000004
#define _SD1CON1_VOSCAL_MASK                     0x00000010
#define _SD1CON1_VOSCAL_LENGTH                   0x00000001

#define _SD1CON1_DITHER_POSITION                 0x00000006
#define _SD1CON1_DITHER_MASK                     0x000000C0
#define _SD1CON1_DITHER_LENGTH                   0x00000002

