MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC010/mcu.h
#define _SD1CON3_SDOSR2_POSITION                 0x0000000C
#define _SD1CON3_SDOSR2_MASK                     0x00001000
#define _SD1CON3_SDOSR2_LENGTH                   0x00000001

#define _SD1CON3_SDDIV0_POSITION                 0x0000000D
#define _SD1CON3_SDDIV0_MASK                     0x00002000
#define _SD1CON3_SDDIV0_LENGTH                   0x00000001

#define _SD1CON3_SDDIV1_POSITION                 0x0000000E
#define _SD1CON3_SDDIV1_MASK                     0x00004000
#define _SD1CON3_SDDIV1_LENGTH                   0x00000001

#define _SD1CON3_SDDIV2_POSITION                 0x0000000F
#define _SD1CON3_SDDIV2_MASK                     0x00008000
#define _SD1CON3_SDDIV2_LENGTH                   0x00000001

#define _ANCFG_VBG2EN_POSITION                   0x00000002
#define _ANCFG_VBG2EN_MASK                       0x00000004
#define _ANCFG_VBG2EN_LENGTH                     0x00000001

#define _ANSA_ANSA1_POSITION                     0x00000001
#define _ANSA_ANSA1_MASK                         0x00000002
#define _ANSA_ANSA1_LENGTH                       0x00000001

#define _ANSA_ANSA2_POSITION                     0x00000002
#define _ANSA_ANSA2_MASK                         0x00000004
#define _ANSA_ANSA2_LENGTH                       0x00000001

#define _ANSA_ANSA4_POSITION                     0x00000004
#define _ANSA_ANSA4_MASK                         0x00000010
#define _ANSA_ANSA4_LENGTH                       0x00000001

#define _ANSA_ANSA5_POSITION                     0x00000005
#define _ANSA_ANSA5_MASK                         0x00000020
#define _ANSA_ANSA5_LENGTH                       0x00000001

#define _ANSA_ANSA6_POSITION                     0x00000006
#define _ANSA_ANSA6_MASK                         0x00000040
#define _ANSA_ANSA6_LENGTH                       0x00000001

#define _ANSA_ANSA7_POSITION                     0x00000007
#define _ANSA_ANSA7_MASK                         0x00000080
#define _ANSA_ANSA7_LENGTH                       0x00000001

#define _ANSA_ANSA9_POSITION                     0x00000009
#define _ANSA_ANSA9_MASK                         0x00000200
#define _ANSA_ANSA9_LENGTH                       0x00000001

#define _ANSA_ANSA10_POSITION                    0x0000000A
#define _ANSA_ANSA10_MASK                        0x00000400
#define _ANSA_ANSA10_LENGTH                      0x00000001

#define _ANSA_ANSA14_POSITION                    0x0000000E
#define _ANSA_ANSA14_MASK                        0x00004000
#define _ANSA_ANSA14_LENGTH                      0x00000001

#define _ANSA_ANSA15_POSITION                    0x0000000F
#define _ANSA_ANSA15_MASK                        0x00008000
#define _ANSA_ANSA15_LENGTH                      0x00000001

#define _ANSA_ANSELA1_POSITION                   0x00000001
#define _ANSA_ANSELA1_MASK                       0x00000002
#define _ANSA_ANSELA1_LENGTH                     0x00000001

#define _ANSA_ANSELA2_POSITION                   0x00000002
#define _ANSA_ANSELA2_MASK                       0x00000004
#define _ANSA_ANSELA2_LENGTH                     0x00000001

#define _ANSA_ANSELA4_POSITION                   0x00000004
#define _ANSA_ANSELA4_MASK                       0x00000010
#define _ANSA_ANSELA4_LENGTH                     0x00000001

#define _ANSA_ANSELA5_POSITION                   0x00000005
#define _ANSA_ANSELA5_MASK                       0x00000020
#define _ANSA_ANSELA5_LENGTH                     0x00000001

#define _ANSA_ANSELA6_POSITION                   0x00000006
#define _ANSA_ANSELA6_MASK                       0x00000040
#define _ANSA_ANSELA6_LENGTH                     0x00000001

#define _ANSA_ANSELA7_POSITION                   0x00000007
#define _ANSA_ANSELA7_MASK                       0x00000080
#define _ANSA_ANSELA7_LENGTH                     0x00000001

#define _ANSA_ANSELA9_POSITION                   0x00000009
#define _ANSA_ANSELA9_MASK                       0x00000200
#define _ANSA_ANSELA9_LENGTH                     0x00000001

#define _ANSA_ANSELA10_POSITION                  0x0000000A
#define _ANSA_ANSELA10_MASK                      0x00000400
#define _ANSA_ANSELA10_LENGTH                    0x00000001

#define _ANSA_ANSELA14_POSITION                  0x0000000E
#define _ANSA_ANSELA14_MASK                      0x00004000
#define _ANSA_ANSELA14_LENGTH                    0x00000001

#define _ANSA_ANSELA15_POSITION                  0x0000000F
#define _ANSA_ANSELA15_MASK                      0x00008000
#define _ANSA_ANSELA15_LENGTH                    0x00000001

#define _ANSELA_ANSA1_POSITION                   0x00000001
#define _ANSELA_ANSA1_MASK                       0x00000002
#define _ANSELA_ANSA1_LENGTH                     0x00000001

#define _ANSELA_ANSA2_POSITION                   0x00000002
#define _ANSELA_ANSA2_MASK                       0x00000004
#define _ANSELA_ANSA2_LENGTH                     0x00000001

#define _ANSELA_ANSA4_POSITION                   0x00000004
#define _ANSELA_ANSA4_MASK                       0x00000010
#define _ANSELA_ANSA4_LENGTH                     0x00000001

#define _ANSELA_ANSA5_POSITION                   0x00000005
#define _ANSELA_ANSA5_MASK                       0x00000020
#define _ANSELA_ANSA5_LENGTH                     0x00000001

#define _ANSELA_ANSA6_POSITION                   0x00000006
#define _ANSELA_ANSA6_MASK                       0x00000040
#define _ANSELA_ANSA6_LENGTH                     0x00000001

#define _ANSELA_ANSA7_POSITION                   0x00000007
#define _ANSELA_ANSA7_MASK                       0x00000080
#define _ANSELA_ANSA7_LENGTH                     0x00000001

#define _ANSELA_ANSA9_POSITION                   0x00000009
#define _ANSELA_ANSA9_MASK                       0x00000200
#define _ANSELA_ANSA9_LENGTH                     0x00000001

#define _ANSELA_ANSA10_POSITION                  0x0000000A
#define _ANSELA_ANSA10_MASK                      0x00000400
#define _ANSELA_ANSA10_LENGTH                    0x00000001

#define _ANSELA_ANSA14_POSITION                  0x0000000E
#define _ANSELA_ANSA14_MASK                      0x00004000
#define _ANSELA_ANSA14_LENGTH                    0x00000001

#define _ANSELA_ANSA15_POSITION                  0x0000000F
#define _ANSELA_ANSA15_MASK                      0x00008000
#define _ANSELA_ANSA15_LENGTH                    0x00000001

#define _ANSELA_ANSELA1_POSITION                 0x00000001
#define _ANSELA_ANSELA1_MASK                     0x00000002
#define _ANSELA_ANSELA1_LENGTH                   0x00000001

