MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC010/mcu.h
#define _ADL1STAT_LBUSY_POSITION                 0x0000000E
#define _ADL1STAT_LBUSY_MASK                     0x00004000
#define _ADL1STAT_LBUSY_LENGTH                   0x00000001

#define _ADL1STAT_ADTACT_POSITION                0x0000000F
#define _ADL1STAT_ADTACT_MASK                    0x00008000
#define _ADL1STAT_ADTACT_LENGTH                  0x00000001

#define _ADTH1L_TH0_POSITION                     0x00000000
#define _ADTH1L_TH0_MASK                         0x00000001
#define _ADTH1L_TH0_LENGTH                       0x00000001

#define _ADTH1L_TH1_POSITION                     0x00000001
#define _ADTH1L_TH1_MASK                         0x00000002
#define _ADTH1L_TH1_LENGTH                       0x00000001

#define _ADTH1L_TH2_POSITION                     0x00000002
#define _ADTH1L_TH2_MASK                         0x00000004
#define _ADTH1L_TH2_LENGTH                       0x00000001

#define _ADTH1L_TH3_POSITION                     0x00000003
#define _ADTH1L_TH3_MASK                         0x00000008
#define _ADTH1L_TH3_LENGTH                       0x00000001

#define _ADTH1L_TH4_POSITION                     0x00000004
#define _ADTH1L_TH4_MASK                         0x00000010
#define _ADTH1L_TH4_LENGTH                       0x00000001

#define _ADTH1L_TH5_POSITION                     0x00000005
#define _ADTH1L_TH5_MASK                         0x00000020
#define _ADTH1L_TH5_LENGTH                       0x00000001

#define _ADTH1L_TH6_POSITION                     0x00000006
#define _ADTH1L_TH6_MASK                         0x00000040
#define _ADTH1L_TH6_LENGTH                       0x00000001

#define _ADTH1L_TH7_POSITION                     0x00000007
#define _ADTH1L_TH7_MASK                         0x00000080
#define _ADTH1L_TH7_LENGTH                       0x00000001

#define _ADTH1L_TH8_POSITION                     0x00000008
#define _ADTH1L_TH8_MASK                         0x00000100
#define _ADTH1L_TH8_LENGTH                       0x00000001

#define _ADTH1L_TH9_POSITION                     0x00000009
#define _ADTH1L_TH9_MASK                         0x00000200
#define _ADTH1L_TH9_LENGTH                       0x00000001

#define _ADTH1L_TH10_POSITION                    0x0000000A
#define _ADTH1L_TH10_MASK                        0x00000400
#define _ADTH1L_TH10_LENGTH                      0x00000001

#define _ADTH1L_TH11_POSITION                    0x0000000B
#define _ADTH1L_TH11_MASK                        0x00000800
#define _ADTH1L_TH11_LENGTH                      0x00000001

#define _ADTH1L_TH12_POSITION                    0x0000000C
#define _ADTH1L_TH12_MASK                        0x00001000
#define _ADTH1L_TH12_LENGTH                      0x00000001

#define _ADTH1L_TH13_POSITION                    0x0000000D
#define _ADTH1L_TH13_MASK                        0x00002000
#define _ADTH1L_TH13_LENGTH                      0x00000001

#define _ADTH1L_TH14_POSITION                    0x0000000E
#define _ADTH1L_TH14_MASK                        0x00004000
#define _ADTH1L_TH14_LENGTH                      0x00000001

#define _ADTH1L_TH15_POSITION                    0x0000000F
#define _ADTH1L_TH15_MASK                        0x00008000
#define _ADTH1L_TH15_LENGTH                      0x00000001

#define _ADTH1H_TH0_POSITION                     0x00000000
#define _ADTH1H_TH0_MASK                         0x00000001
#define _ADTH1H_TH0_LENGTH                       0x00000001

#define _ADTH1H_TH1_POSITION                     0x00000001
#define _ADTH1H_TH1_MASK                         0x00000002
#define _ADTH1H_TH1_LENGTH                       0x00000001

#define _ADTH1H_TH2_POSITION                     0x00000002
#define _ADTH1H_TH2_MASK                         0x00000004
#define _ADTH1H_TH2_LENGTH                       0x00000001

#define _ADTH1H_TH3_POSITION                     0x00000003
#define _ADTH1H_TH3_MASK                         0x00000008
#define _ADTH1H_TH3_LENGTH                       0x00000001

#define _ADTH1H_TH4_POSITION                     0x00000004
#define _ADTH1H_TH4_MASK                         0x00000010
#define _ADTH1H_TH4_LENGTH                       0x00000001

#define _ADTH1H_TH5_POSITION                     0x00000005
#define _ADTH1H_TH5_MASK                         0x00000020
#define _ADTH1H_TH5_LENGTH                       0x00000001

#define _ADTH1H_TH6_POSITION                     0x00000006
#define _ADTH1H_TH6_MASK                         0x00000040
#define _ADTH1H_TH6_LENGTH                       0x00000001

#define _ADTH1H_TH7_POSITION                     0x00000007
#define _ADTH1H_TH7_MASK                         0x00000080
#define _ADTH1H_TH7_LENGTH                       0x00000001

#define _ADTH1H_TH8_POSITION                     0x00000008
#define _ADTH1H_TH8_MASK                         0x00000100
#define _ADTH1H_TH8_LENGTH                       0x00000001

#define _ADTH1H_TH9_POSITION                     0x00000009
#define _ADTH1H_TH9_MASK                         0x00000200
#define _ADTH1H_TH9_LENGTH                       0x00000001

#define _ADTH1H_TH10_POSITION                    0x0000000A
#define _ADTH1H_TH10_MASK                        0x00000400
#define _ADTH1H_TH10_LENGTH                      0x00000001

#define _ADTH1H_TH11_POSITION                    0x0000000B
#define _ADTH1H_TH11_MASK                        0x00000800
#define _ADTH1H_TH11_LENGTH                      0x00000001

#define _ADTH1H_TH12_POSITION                    0x0000000C
#define _ADTH1H_TH12_MASK                        0x00001000
#define _ADTH1H_TH12_LENGTH                      0x00000001

#define _ADTH1H_TH13_POSITION                    0x0000000D
#define _ADTH1H_TH13_MASK                        0x00002000
#define _ADTH1H_TH13_LENGTH                      0x00000001

#define _ADTH1H_TH14_POSITION                    0x0000000E
#define _ADTH1H_TH14_MASK                        0x00004000
#define _ADTH1H_TH14_LENGTH                      0x00000001

#define _ADTH1H_TH15_POSITION                    0x0000000F
#define _ADTH1H_TH15_MASK                        0x00008000
#define _ADTH1H_TH15_LENGTH                      0x00000001

#define _ADL1MSEL0_MSEL15_POSITION               0x0000000F
#define _ADL1MSEL0_MSEL15_MASK                   0x00008000
#define _ADL1MSEL0_MSEL15_LENGTH                 0x00000001

