MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GC010/mcu.h
#define _RPOR17_RP35R4_POSITION                  0x0000000C
#define _RPOR17_RP35R4_MASK                      0x00001000
#define _RPOR17_RP35R4_LENGTH                    0x00000001

#define _RPOR17_RP35R5_POSITION                  0x0000000D
#define _RPOR17_RP35R5_MASK                      0x00002000
#define _RPOR17_RP35R5_LENGTH                    0x00000001

#define _RPOR18_RP36R_POSITION                   0x00000000
#define _RPOR18_RP36R_MASK                       0x0000003F
#define _RPOR18_RP36R_LENGTH                     0x00000006

#define _RPOR18_RP37R_POSITION                   0x00000008
#define _RPOR18_RP37R_MASK                       0x00003F00
#define _RPOR18_RP37R_LENGTH                     0x00000006

#define _RPOR18_RP36R0_POSITION                  0x00000000
#define _RPOR18_RP36R0_MASK                      0x00000001
#define _RPOR18_RP36R0_LENGTH                    0x00000001

#define _RPOR18_RP36R1_POSITION                  0x00000001
#define _RPOR18_RP36R1_MASK                      0x00000002
#define _RPOR18_RP36R1_LENGTH                    0x00000001

#define _RPOR18_RP36R2_POSITION                  0x00000002
#define _RPOR18_RP36R2_MASK                      0x00000004
#define _RPOR18_RP36R2_LENGTH                    0x00000001

#define _RPOR18_RP36R3_POSITION                  0x00000003
#define _RPOR18_RP36R3_MASK                      0x00000008
#define _RPOR18_RP36R3_LENGTH                    0x00000001

#define _RPOR18_RP36R4_POSITION                  0x00000004
#define _RPOR18_RP36R4_MASK                      0x00000010
#define _RPOR18_RP36R4_LENGTH                    0x00000001

#define _RPOR18_RP36R5_POSITION                  0x00000005
#define _RPOR18_RP36R5_MASK                      0x00000020
#define _RPOR18_RP36R5_LENGTH                    0x00000001

#define _RPOR18_RP37R0_POSITION                  0x00000008
#define _RPOR18_RP37R0_MASK                      0x00000100
#define _RPOR18_RP37R0_LENGTH                    0x00000001

#define _RPOR18_RP37R1_POSITION                  0x00000009
#define _RPOR18_RP37R1_MASK                      0x00000200
#define _RPOR18_RP37R1_LENGTH                    0x00000001

#define _RPOR18_RP37R2_POSITION                  0x0000000A
#define _RPOR18_RP37R2_MASK                      0x00000400
#define _RPOR18_RP37R2_LENGTH                    0x00000001

#define _RPOR18_RP37R3_POSITION                  0x0000000B
#define _RPOR18_RP37R3_MASK                      0x00000800
#define _RPOR18_RP37R3_LENGTH                    0x00000001

#define _RPOR18_RP37R4_POSITION                  0x0000000C
#define _RPOR18_RP37R4_MASK                      0x00001000
#define _RPOR18_RP37R4_LENGTH                    0x00000001

#define _RPOR18_RP37R5_POSITION                  0x0000000D
#define _RPOR18_RP37R5_MASK                      0x00002000
#define _RPOR18_RP37R5_LENGTH                    0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_SWDTEN_POSITION                    0x00000005
#define _RCON_SWDTEN_MASK                        0x00000020
#define _RCON_SWDTEN_LENGTH                      0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_VREGS_POSITION                     0x00000008
#define _RCON_VREGS_MASK                         0x00000100
#define _RCON_VREGS_LENGTH                       0x00000001

#define _RCON_CM_POSITION                        0x00000009
#define _RCON_CM_MASK                            0x00000200
#define _RCON_CM_LENGTH                          0x00000001

#define _RCON_DPSLP_POSITION                     0x0000000A
#define _RCON_DPSLP_MASK                         0x00000400
#define _RCON_DPSLP_LENGTH                       0x00000001

#define _RCON_RETEN_POSITION                     0x0000000C
#define _RCON_RETEN_MASK                         0x00001000
#define _RCON_RETEN_LENGTH                       0x00000001

#define _RCON_SBOREN_POSITION                    0x0000000D
#define _RCON_SBOREN_MASK                        0x00002000
#define _RCON_SBOREN_LENGTH                      0x00000001

#define _RCON_IOPUWR_POSITION                    0x0000000E
#define _RCON_IOPUWR_MASK                        0x00004000
#define _RCON_IOPUWR_LENGTH                      0x00000001

#define _RCON_TRAPR_POSITION                     0x0000000F
#define _RCON_TRAPR_MASK                         0x00008000
#define _RCON_TRAPR_LENGTH                       0x00000001

#define _RCON_PMSLP_POSITION                     0x00000008
#define _RCON_PMSLP_MASK                         0x00000100
#define _RCON_PMSLP_LENGTH                       0x00000001

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

#define _OSCCON_SOSCEN_POSITION                  0x00000001
#define _OSCCON_SOSCEN_MASK                      0x00000002
#define _OSCCON_SOSCEN_LENGTH                    0x00000001

#define _OSCCON_POSCEN_POSITION                  0x00000002
#define _OSCCON_POSCEN_MASK                      0x00000004
#define _OSCCON_POSCEN_LENGTH                    0x00000001

